app/controllers/students_controller.rb

    def edit
        @student = Student.find(params[:id]) #looks up article to display filled in data
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]